Backend/app/controllers/movies_controller.rb

SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."movie_id" = ?  [["movie_id", 1]]
---
    def index
       movie = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        movie = Movie.find_by(id: params[:id])