Backend/app/controllers/reviews_controller.rb

    def create
        user_movie = Review.create(review_params)
---
INSERT INTO "reviews" ("movie", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["movie", nil], ["comment", "i enjoyed every bit of it "], ["user_id", 13], ["movie_id", 6], ["created_at", "2023-04-02 21:06:58.368419"], ["updated_at", "2023-04-02 21:06:58.368419"]]