Backend/app/controllers/users_controller.rb

  def show
    # current_user = User.find(session[:user_id])
    current_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "year_born", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)