Backend/app/controllers/user_movies_controller.rb

SELECT "user_movies".* FROM "user_movies"
---
  def index
    user_movies = UserMovie.all

SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    votes = UserMovie.find(params[:id])

INSERT INTO "user_movies" ("rating", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", nil], ["user_id", 7], ["movie_id", 1], ["created_at", "2023-04-01 22:41:15.724979"], ["updated_at", "2023-04-01 22:41:15.724979"]]
---
  def create
    user_movie = UserMovie.create(user_movie_params)

SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_user_movie
      user_movie = UserMovie.find(params[:id])